HuffieWang/STM32F4-JPEG/Driver/LCD/hnit_lcd.c
/*********************** HNIT 3103 Application Team **************************
 * 文 件 名 ：hnit_lcd.h
 * 描    述 ：ILI9341液晶显示    
 * 实验平台 ：STM32F407开发板
 * 库 版 本 ：ST1.4.0
 * 时    间 ：2016.3.20
 * 原 作 者 ：正点原子 www.opendv.com
 * 修改记录 ：1. 2016.3.20  3103创新团队 王昱霏
 *               - 新增黑白图像显示函数lcd_show_image();
 *               - 新增简便数字显示函数lcd_show_num();
 *            2. 2016.4.9   3103创新团队 王昱霏
 *               - 修改了LCD_DisNum()不能显示数字0的BUG;
 *            3. 2016.4.19  3103创新团队 王昱霏
 *               - 因显示摄像头图像要用扫描方向5，而显示数字和图像需用方向3，
 *                 所以在lcd_show_image()和lcd_show_num()中加入扫描方向切换。
 *            4. 2016.4.21  3103创新团队 王昱霏
 *               - 删除lcd_show_image()中的扫描切换，因为对视频数据做了处理，
 *                 不再需要了
 *            5. 2016.4.24  3103创新团队 王昱霏
 *               - 扫描方向固定为3（从右到左，从下到上），所有函数不做切换 
 *               - 新增“画点“函数lcd_draw_point()
 *            6. 2016.4.27  3103创新团队 王昱霏
 *               - 完善lcd_show_num()，现在可以显示负整数了
******************************************************************************/

#include "hnit_lcd.h"
#include "stdlib.h"
#include "font.h" 
#include "stm32_usart.h"	 
#include "stm32_delay.h"	 
				   
u16 POINT_COLOR=0x0000;	//画笔颜色
u16 BACK_COLOR=0xFFFF;  //背景色 
_lcd_dev lcddev;        //LCD管理重要参数

/**
  * @brief  显示80*80的二值图像，为适应240*240的屏幕，我们将它放大了9倍
  * @param  m[80][80] 待显示的图像
  * @retval 无
  */
void lcd_show_image(uint8_t m[80][80])
{  
    u16 i, j, n;
    lcd_scan_dir(3);  
    for(i = 0; i < 80; i++)
    {
        for(n = 0; n < 3; n++)
        {           
            lcd_set_cursor(0, i*3+n);  // 设置光标位置                   
            lcd_write_ram_prepare();   // 开始写入GRAM     
            for(j = 0; j < 80; j++)
            {
                if(m[i][j] == 0)
                {
                    LCD->LCD_RAM = WHITE; 
                    LCD->LCD_RAM = WHITE;
                    LCD->LCD_RAM = WHITE;                                   
                }
                else
                {
                    LCD->LCD_RAM = BLACK;
                    LCD->LCD_RAM = BLACK;
                    LCD->LCD_RAM = BLACK;
                }               
            }
        }
    }    
}  

/**
  * @brief  LCD显示数字，字体大小16，模式填充
  * @param  x 起点行坐标
  * @param  y 起点列坐标
  * @param  num 待显示的数字
  * @retval 无
  */
void lcd_show_num(u16 y, u16 x, int32_t m)
{  
    u8 len = 0, size = 16;  
    u8 t, temp;   
    u8 enshow = 0;	
    u32 num, n;
    
    lcd_scan_dir(3);
    
    if(m < 0)
    {
        num = -m;
        len++;
        t = 1;      
        LCD_ShowChar(x, y, '-', size, 0);
    }
    else
    {
        t = 0;
        num = m;
    }
      
    // 求数字长度
    n = num;
    while(n)
    {
        n/=10;
        len++;
    }
    if(len == 0)
    {
        LCD_ShowChar(x, y, '0', size, 0);
    }
    
    // 参考至本文件 LCD_ShowxNum
    for(; t < len; t++)
    {
        temp = (num/LCD_Pow(10,len-t-1))%10;
        if( (enshow == 0)&&(t<(len-1)) )
        {
            if(temp == 0)
            {
                LCD_ShowChar(x+(size/2)*t, y, ' ', size, 0);  
                continue;
            }
            else
            {
                enshow = 1; 
            }	 	 
        }
        LCD_ShowChar(x+(size/2)*t, y, temp+'0', size, 0); 
    }
} 

/**
  * @brief  在LCD上画一个3*3的点
  * @param  x 起点行坐标
  * @param  y 起点列坐标
  * @param  color 颜色
  * @retval 无
  */
void lcd_draw_point(uint16_t x, uint16_t y, uint16_t color)
{
    uint16_t sava = POINT_COLOR;
    if(x < 79 && y < 79 )
    {
        lcd_scan_dir(3);
        POINT_COLOR = color;
        lcd_set_cursor(y*3, x*3);		
        lcd_write_ram_prepare();	
        LCD->LCD_RAM = RED;LCD->LCD_RAM = RED;LCD->LCD_RAM = RED;
        lcd_set_cursor(y*3, x*3+1);		
        lcd_write_ram_prepare();
        LCD->LCD_RAM = RED;LCD->LCD_RAM = RED;LCD->LCD_RAM = RED;
        lcd_set_cursor(y*3, x*3+2);	
        lcd_write_ram_prepare();    
        LCD->LCD_RAM = RED;LCD->LCD_RAM = RED;LCD->LCD_RAM = RED;   
        POINT_COLOR = sava;
    }
}

/****************** 以下为正点原子lcd.c源码 www.opendv.com *******************/
//写寄存器函数
//regval:寄存器值
void LCD_WR_REG(vu16 regval)
{   
	regval=regval;		//使用-O2优化的时候,必须插入的延时
	LCD->LCD_REG=regval;//写入要写的寄存器序号	 
}

//写LCD数据
//data:要写入的值
void LCD_WR_DATA(vu16 data)
{	 
	data=data;			//使用-O2优化的时候,必须插入的延时
	LCD->LCD_RAM=data;		 
}

//读LCD数据
//返回值:读到的值
u16 LCD_RD_DATA(void)
{		
	vu16 ram;			//防止被优化
	ram=LCD->LCD_RAM;
	return ram;		 
}

//写寄存器
//LCD_Reg:寄存器地址
//LCD_RegValue:要写入的数据
void LCD_WriteReg(vu16 LCD_Reg, vu16 LCD_RegValue)
{	
	LCD->LCD_REG = LCD_Reg;		//写入要写的寄存器序号	 
	LCD->LCD_RAM = LCD_RegValue;//写入数据	    		 
}	 

//读寄存器
//LCD_Reg:寄存器地址
//返回值:读到的数据
u16 LCD_ReadReg(vu16 LCD_Reg)
{										   
	LCD_WR_REG(LCD_Reg);		//写入要读的寄存器序号
	delay_us(5);		  
	return LCD_RD_DATA();		//返回读到的值
}  

//开始写GRAM
void lcd_write_ram_prepare(void)
{
 	LCD->LCD_REG=lcddev.wramcmd;	  
}	 

//LCD写GRAM
//RGB_Code:颜色值
void LCD_WriteRAM(u16 RGB_Code)
{							    
	LCD->LCD_RAM = RGB_Code;//写十六位GRAM
}

//从ILI93xx读出的数据为GBR格式，而我们写入的时候为RGB格式。
//通过该函数转换
//c:GBR格式的颜色值
//返回值：RGB格式的颜色值
u16 LCD_BGR2RGB(u16 c)
{
	u16  r,g,b,rgb;   
	b=(c>>0)&0x1f;
	g=(c>>5)&0x3f;
	r=(c>>11)&0x1f;	 
	rgb=(b<<11)+(g<<5)+(r<<0);		 
	return(rgb);
} 

//当mdk -O1时间优化时需要设置
//延时i
void opt_delay(u8 i)
{
	while(i--);
}

//读取个某点的颜色值	 
//x,y:坐标
//返回值:此点的颜色
u16 LCD_ReadPoint(u16 x,u16 y)
{
 	vu16 r=0,g=0,b=0;
	if(x>=lcddev.width||y>=lcddev.height)return 0;	//超过了范围,直接返回		   
	lcd_set_cursor(x,y);	    
	if(lcddev.id==0X9341||lcddev.id==0X6804||lcddev.id==0X5310)LCD_WR_REG(0X2E);//9341/6804/3510 发送读GRAM指令
	else if(lcddev.id==0X5510)LCD_WR_REG(0X2E00);	//5510 发送读GRAM指令
	else LCD_WR_REG(R34);      		 				//其他IC发送读GRAM指令
	if(lcddev.id==0X9320)opt_delay(2);				//FOR 9320,延时2us	    
 	LCD_RD_DATA();									//dummy Read	   
	opt_delay(2);	  
 	r=LCD_RD_DATA();  		  						//实际坐标颜色
 	if(lcddev.id==0X9341||lcddev.id==0X5310||lcddev.id==0X5510)		//9341/NT35310/NT35510要分2次读出
 	{
		opt_delay(2);	  
		b=LCD_RD_DATA(); 
		g=r&0XFF;		//对于9341/5310/5510,第一次读取的是RG的值,R在前,G在后,各占8位
		g<<=8;
	} 
	if(lcddev.id==0X9325||lcddev.id==0X4535||lcddev.id==0X4531||lcddev.id==0XB505||lcddev.id==0XC505)return r;	//这几种IC直接返回颜色值
	else if(lcddev.id==0X9341||lcddev.id==0X5310||lcddev.id==0X5510)return (((r>>11)<<11)|((g>>10)<<5)|(b>>11));//ILI9341/NT35310/NT35510需要公式转换一下
	else return LCD_BGR2RGB(r);						//其他IC
}

//LCD开启显示
void LCD_DisplayOn(void)
{					   
	if(lcddev.id==0X9341||lcddev.id==0X6804||lcddev.id==0X5310)LCD_WR_REG(0X29);	//开启显示
	else if(lcddev.id==0X5510)LCD_WR_REG(0X2900);	//开启显示
	else LCD_WriteReg(R7,0x0173); 				 	//开启显示
}	

//LCD关闭显示
void LCD_DisplayOff(void)
{	   
	if(lcddev.id==0X9341||lcddev.id==0X6804||lcddev.id==0X5310)LCD_WR_REG(0X28);	//关闭显示
	else if(lcddev.id==0X5510)LCD_WR_REG(0X2800);	//关闭显示
	else LCD_WriteReg(R7,0x0);//关闭显示 
} 

//设置光标位置
//Xpos:横坐标
//Ypos:纵坐标
void lcd_set_cursor(u16 Xpos, u16 Ypos)
{	 
 	if(lcddev.id==0X9341||lcddev.id==0X5310)
	{		    
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(Xpos>>8); 
		LCD_WR_DATA(Xpos&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(Ypos>>8); 
		LCD_WR_DATA(Ypos&0XFF);
	}else if(lcddev.id==0X6804)
	{
		if(lcddev.dir==1)Xpos=lcddev.width-1-Xpos;//横屏时处理
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(Xpos>>8); 
		LCD_WR_DATA(Xpos&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(Ypos>>8); 
		LCD_WR_DATA(Ypos&0XFF);
	}else if(lcddev.id==0X5510)
	{
		LCD_WR_REG(lcddev.setxcmd); 
		LCD_WR_DATA(Xpos>>8); 
		LCD_WR_REG(lcddev.setxcmd+1); 
		LCD_WR_DATA(Xpos&0XFF);	 
		LCD_WR_REG(lcddev.setycmd); 
		LCD_WR_DATA(Ypos>>8); 
		LCD_WR_REG(lcddev.setycmd+1); 
		LCD_WR_DATA(Ypos&0XFF);		
	}else
	{
		if(lcddev.dir==1)Xpos=lcddev.width-1-Xpos;//横屏其实就是调转x,y坐标
		LCD_WriteReg(lcddev.setxcmd, Xpos);
		LCD_WriteReg(lcddev.setycmd, Ypos);
	}	 
} 	
  
//设置LCD的自动扫描方向
//注意:其他函数可能会受到此函数设置的影响(尤其是9341/6804这两个奇葩),
//所以,一般设置为L2R_U2D即可,如果设置为其他扫描方式,可能导致显示不正常.
//dir:0~7,代表8个方向(具体定义见lcd.h)
//9320/9325/9328/4531/4535/1505/b505/8989/5408/9341/5310/5510等IC已经实际测试	   	   
void lcd_scan_dir(u8 dir)
{
	u16 regval=0;
	u16 dirreg=0;
	u16 temp;  
	u16 xsize,ysize;
	if(lcddev.dir==1&&lcddev.id!=0X6804)//横屏时，对6804不改变扫描方向！
	{			   
		switch(dir)//方向转换
		{
			case 0:dir=6;break;
			case 1:dir=7;break;
			case 2:dir=4;break;
			case 3:dir=5;break;
			case 4:dir=1;break;
			case 5:dir=0;break;
			case 6:dir=3;break;
			case 7:dir=2;break;	     
		}
	}
	if(lcddev.id==0x9341||lcddev.id==0X6804||lcddev.id==0X5310||lcddev.id==0X5510)//9341/6804/5310/5510,很特殊
	{
		switch(dir)
		{
			case L2R_U2D://从左到右,从上到下
				regval|=(0<<7)|(0<<6)|(0<<5); 
				break;
			case L2R_D2U://从左到右,从下到上
				regval|=(1<<7)|(0<<6)|(0<<5); 
				break;
			case R2L_U2D://从右到左,从上到下
				regval|=(0<<7)|(1<<6)|(0<<5); 
				break;
			case R2L_D2U://从右到左,从下到上
				regval|=(1<<7)|(1<<6)|(0<<5); 
				break;	 
			case U2D_L2R://从上到下,从左到右
				regval|=(0<<7)|(0<<6)|(1<<5); 
				break;
			case U2D_R2L://从上到下,从右到左
				regval|=(0<<7)|(1<<6)|(1<<5); 
				break;
			case D2U_L2R://从下到上,从左到右
				regval|=(1<<7)|(0<<6)|(1<<5); 
				break;
			case D2U_R2L://从下到上,从右到左
				regval|=(1<<7)|(1<<6)|(1<<5); 
				break;	 
		}
		if(lcddev.id==0X5510)dirreg=0X3600;
		else dirreg=0X36;
 		if((lcddev.id!=0X5310)&&(lcddev.id!=0X5510))regval|=0X08;//5310/5510不需要BGR   
		if(lcddev.id==0X6804)regval|=0x02;//6804的BIT6和9341的反了	   
		LCD_WriteReg(dirreg,regval);
 		if((regval&0X20)||lcddev.dir==1)
		{
			if(lcddev.width<lcddev.height)//交换X,Y
			{
				temp=lcddev.width;
				lcddev.width=lcddev.height;
				lcddev.height=temp;
 			}
		}else  
		{
			if(lcddev.width>lcddev.height)//交换X,Y
			{
				temp=lcddev.width;
				lcddev.width=lcddev.height;
				lcddev.height=temp;
 			}
		}  
		if(lcddev.dir==1&&lcddev.id!=0X6804)
		{
			xsize=lcddev.height;
			ysize=lcddev.width;
		}else
		{
			xsize=lcddev.width;
			ysize=lcddev.height;
		}
		if(lcddev.id==0X5510)
		{
			LCD_WR_REG(lcddev.setxcmd);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setxcmd+1);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setxcmd+2);LCD_WR_DATA((xsize-1)>>8); 
			LCD_WR_REG(lcddev.setxcmd+3);LCD_WR_DATA((xsize-1)&0XFF); 
			LCD_WR_REG(lcddev.setycmd);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setycmd+1);LCD_WR_DATA(0); 
			LCD_WR_REG(lcddev.setycmd+2);LCD_WR_DATA((ysize-1)>>8); 
			LCD_WR_REG(lcddev.setycmd+3);LCD_WR_DATA((ysize-1)&0XFF);
		}else
		{
			LCD_WR_REG(lcddev.setxcmd); 
			LCD_WR_DATA(0);LCD_WR_DATA(0);
			LCD_WR_DATA((xsize-1)>>8);LCD_WR_DATA((xsize-1)&0XFF);
			LCD_WR_REG(lcddev.setycmd); 
			LCD_WR_DATA(0);LCD_WR_DATA(0);
			LCD_WR_DATA((ysize-1)>>8);LCD_WR_DATA((ysize-1)&0XFF);  
		}
  	}else 
	{
		switch(dir)
		{
			case L2R_U2D://从左到右,从上到下
				regval|=(1<<5)|(1<<4)|(0<<3); 
				break;
			case L2R_D2U://从左到右,从下到上
				regval|=(0<<5)|(1<<4)|(0<<3); 
				break;
			case R2L_U2D://从右到左,从上到下
				regval|=(1<<5)|(0<<4)|(0<<3);
				break;
			case R2L_D2U://从右到左,从下到上
				regval|=(0<<5)|(0<<4)|(0<<3); 
				break;	 
			case U2D_L2R://从上到下,从左到右
				regval|=(1<<5)|(1<<4)|(1<<3); 
				break;
			case U2D_R2L://从上到下,从右到左
				regval|=(1<<5)|(0<<4)|(1<<3); 
				break;
			case D2U_L2R://从下到上,从左到右
				regval|=(0<<5)|(1<<4)|(1<<3); 
				break;
			case D2U_R2L://从下到上,从右到左
				regval|=(0<<5)|(0<<4)|(1<<3); 
				break;	 
		}
		if(lcddev.id==0x8989)//8989 IC
		{
			dirreg=0X11;
			regval|=0X6040;	//65K   
	 	}else//其他驱动IC		  
		{
			dirreg=0X03;
			regval|=1<<12;  
		}
		LCD_WriteReg(dirreg,regval);
	}
}

//画点
//x,y:坐标
//POINT_COLOR:此点的颜色
void LCD_DrawPoint(u16 x,u16 y)
{
	lcd_set_cursor(x,y);		//设置光标位置 
	lcd_write_ram_prepare();	//开始写入GRAM
	LCD->LCD_RAM=POINT_COLOR; 
}

